*** src/exchange.rs:639:46: replace - with + in Exchange<I, D, BaseOrQuote, UserOrderIdT, TransactionAccountingT>::check_active_orders

*** mutation diff:
--- src/exchange.rs
+++ replace - with + in Exchange<I, D, BaseOrQuote, UserOrderIdT, TransactionAccountingT>::check_active_orders
@@ -631,17 +631,17 @@
                     &self.position,
                 );
                 debug_assert!(
                     new_order_margin <= order_margin,
                     "The order margin does not increase with a filled limit order event."
                 );
 
                 if new_order_margin < order_margin {
-                    let delta = order_margin - new_order_margin;
+                    let delta = order_margin + /* ~ changed by cargo-mutants ~ */ new_order_margin;
                     let transaction =
                         Transaction::new(USER_WALLET_ACCOUNT, USER_ORDER_MARGIN_ACCOUNT, delta);
                     self.transaction_accounting
                         .create_margin_transfer(transaction)
                         .expect("margin transfer works");
                 }
             }
         }

---- tests::amend::amend_limit_order_qty_with_partial_fill_leading_to_cancel::basecurrency_new_3_0_expects stdout ----
2025-03-10T19:12:09.603502Z TRACE amend_limit_order_qty_with_partial_fill_leading_to_cancel: lfest::exchange: update_state: market_update: bid: 100.00000 Quote, ask: 101.00000 Quote
2025-03-10T19:12:09.603526Z TRACE amend_limit_order_qty_with_partial_fill_leading_to_cancel: lfest::exchange: submit_order: user_id: NoUserOrderId, limit Buy 5.00000 Base @ 100.00000 Quote, state: NewOrder
2025-03-10T19:12:09.603574Z TRACE amend_limit_order_qty_with_partial_fill_leading_to_cancel: lfest::order_margin: order_margin_internal: position: Neutral, active_limit_orders: ActiveLimitOrders { arena: [] }
2025-03-10T19:12:09.603585Z TRACE amend_limit_order_qty_with_partial_fill_leading_to_cancel: lfest::order_margin: order_margin_internal: position: Neutral, active_limit_orders: ActiveL

---- tests::amend::amend_limit_order_qty_with_partial_fill_leading_to_cancel::basecurrency_new_1_0_expects stdout ----
2025-03-10T19:12:09.603483Z TRACE amend_limit_order_qty_with_partial_fill_leading_to_cancel: lfest::exchange: update_state: market_update: bid: 100.00000 Quote, ask: 101.00000 Quote
2025-03-10T19:12:09.603553Z TRACE amend_limit_order_qty_with_partial_fill_leading_to_cancel: lfest::exchange: submit_order: user_id: NoUserOrderId, limit Buy 5.00000 Base @ 100.00000 Quote, state: NewOrder
2025-03-10T19:12:09.603564Z TRACE amend_limit_order_qty_with_partial_fill_leading_to_cancel: lfest::order_margin: order_margin_internal: position: Neutral, active_limit_orders: ActiveLimitOrders { arena: [] }
2025-03-10T19:12:09.603679Z TRACE amend_limit_order_qty_with_partial_fill_leading_to_cancel: lfest::order_margin: order_margin_internal: position: Neutral, active_limit_orders: ActiveL

---- tests::amend::amend_limit_order_qty_with_partial_fill::basecurrency_new_5_0_expects stdout ----
2025-03-10T19:12:09.603380Z TRACE amend_limit_order_qty_with_partial_fill: lfest::exchange: update_state: market_update: bid: 100.00000 Quote, ask: 101.00000 Quote
2025-03-10T19:12:09.603577Z TRACE amend_limit_order_qty_with_partial_fill: lfest::exchange: submit_order: user_id: NoUserOrderId, limit Buy 5.00000 Base @ 100.00000 Quote, state: NewOrder
2025-03-10T19:12:09.603588Z TRACE amend_limit_order_qty_with_partial_fill: lfest::order_margin: order_margin_internal: position: Neutral, active_limit_orders: ActiveLimitOrders { arena: [] }
2025-03-10T19:12:09.603598Z TRACE amend_limit_order_qty_with_partial_fill: lfest::order_margin: order_margin_internal: position: Neutral, active_limit_orders: ActiveLimitOrders { arena: [] }
2025-03-10T19:12:09.603661Z TRACE amend_limit_order_qty_with_part

failures:
    tests::amend::amend_limit_order_qty_with_partial_fill::basecurrency_new_4_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill::basecurrency_new_5_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill::basecurrency_new_6_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill_leading_to_cancel::basecurrency_new_1_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill_leading_to_cancel::basecurrency_new_2_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill_leading_to_cancel::basecurrency_new_3_0_expects
    tests::partial_order_fill::partial_limit_order_fill::with_buy_order
    tests::partial_order_fill::partial_limit_order_fill::with_sell_order

test result: FAILED. 685 passed; 8 failed; 4 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
