*** src/types/smol_currency/base_currency.rs:87:38: replace / with % in <impl Currency<I, D> for BaseCurrency<I, D>>::convert_from

*** mutation diff:
--- src/types/smol_currency/base_currency.rs
+++ replace / with % in <impl Currency<I, D> for BaseCurrency<I, D>>::convert_from
@@ -79,17 +79,17 @@
 impl<I, const D: u8> Currency<I, D> for BaseCurrency<I, D>
 where
     I: Mon<D>,
 {
     // Generic over the decimal points in paired currency.
     type PairedCurrency = QuoteCurrency<I, D>;
 
     fn convert_from(units: Self::PairedCurrency, price_per_unit: QuoteCurrency<I, D>) -> Self {
-        BaseCurrency(*units.as_ref() / *price_per_unit.as_ref())
+        BaseCurrency(*units.as_ref() % /* ~ changed by cargo-mutants ~ */ *price_per_unit.as_ref())
     }
 }
 
 /// Inverse futures where the `Base` currency is used as margin currency.
 ///
 /// # Generics:
 /// - `I`: The numeric data type of `Decimal`.
 /// - `D`: The constant decimal precision of the `BaseCurrency`.

---- types::smol_currency::tests::convert_quote_to_base stdout ----

thread 'types::smol_currency::tests::convert_quote_to_base' panicked at src/types/smol_currency/mod.rs:80:9:
assertion `left == right` failed
  left: BaseCurrency(Decimal(2500000))
 right: BaseCurrency(Decimal(2500))

---- types::smol_currency::tests::base_currency_pnl stdout ----

thread 'types::smol_currency::tests::base_currency_pnl' panicked at src/types/smol_currency/mod.rs:103:9:
assertion `left == right` failed
  left: BaseCurrency(Decimal(-1000000))
 right: BaseCurrency(Decimal(25000))

failures:
    types::smol_currency::tests::base_currency_pnl
    types::smol_currency::tests::convert_quote_to_base

test result: FAILED. 691 passed; 2 failed; 4 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
