*** src/market_state.rs:87:9: replace MarketState<I, D>::current_timestamp_ns -> TimestampNs with Default::default()

*** mutation diff:
--- src/market_state.rs
+++ replace MarketState<I, D>::current_timestamp_ns -> TimestampNs with Default::default()
@@ -79,17 +79,17 @@
     #[inline(always)]
     pub fn mid_price(&self) -> QuoteCurrency<I, D> {
         (self.bid + self.ask) / Decimal::TWO
     }
 
     /// Get the last observed timestamp in nanoseconts
     #[inline(always)]
     pub fn current_timestamp_ns(&self) -> TimestampNs {
-        self.current_ts_ns
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     #[allow(missing_docs)]
     #[cfg(test)]
     pub fn from_components(
         bid: QuoteCurrency<I, D>,
         ask: QuoteCurrency<I, D>,
         last_trade_price: QuoteCurrency<I, D>,

---- tests::partial_order_fill::partial_limit_order_fill::with_sell_order stdout ----
2025-03-10T19:12:43.423575Z TRACE partial_limit_order_fill: lfest::exchange: update_state: market_update: bid: 100.00000 Quote, ask: 101.00000 Quote
2025-03-10T19:12:43.423597Z TRACE partial_limit_order_fill: lfest::exchange: submit_order: user_id: NoUserOrderId, limit Sell 2.00000 Base @ 101.00000 Quote, state: NewOrder
2025-03-10T19:12:43.423610Z TRACE partial_limit_order_fill: lfest::order_margin: order_margin_internal: position: Neutral, active_limit_orders: ActiveLimitOrders { arena: [] }
2025-03-10T19:12:43.423625Z TRACE partial_limit_order_fill: lfest::order_margin: order_margin_internal: position: Neutral, active_limit_orders: ActiveLimitOrders { arena: [] }
2025-03-10T19:12:43.423633Z TRACE partial_limit_order_fill: lfest::risk_engine::isolated_margin: order_margin: QuoteCurrency(Decimal(0)), n

---- tests::partial_order_fill::partial_limit_order_fill::with_buy_order stdout ----
2025-03-10T19:12:43.423408Z TRACE partial_limit_order_fill: lfest::exchange: update_state: market_update: bid: 100.00000 Quote, ask: 101.00000 Quote
2025-03-10T19:12:43.423419Z TRACE partial_limit_order_fill: lfest::exchange: submit_order: user_id: NoUserOrderId, limit Buy 2.00000 Base @ 100.00000 Quote, state: NewOrder
2025-03-10T19:12:43.423461Z TRACE partial_limit_order_fill: lfest::order_margin: order_margin_internal: position: Neutral, active_limit_orders: ActiveLimitOrders { arena: [] }
2025-03-10T19:12:43.423529Z TRACE partial_limit_order_fill: lfest::order_margin: order_margin_internal: position: Neutral, active_limit_orders: ActiveLimitOrders { arena: [] }
2025-03-10T19:12:43.424009Z TRACE partial_limit_order_fill: lfest::risk_engine::isolated_margin: order_margin: QuoteCurrency(Decimal(0)), new

---- tests::submit_limit_buy_order::submit_limit_buy_order_no_position stdout ----
2025-03-10T19:12:43.423594Z TRACE submit_limit_buy_order_no_position: lfest::exchange: update_state: market_update: bid: 99.00000 Quote, ask: 100.00000 Quote
2025-03-10T19:12:43.423624Z TRACE submit_limit_buy_order_no_position: lfest::exchange: submit_order: user_id: NoUserOrderId, limit Buy 5.00000 Base @ 98.00000 Quote, state: NewOrder
2025-03-10T19:12:43.423632Z TRACE submit_limit_buy_order_no_position: lfest::order_margin: order_margin_internal: position: Neutral, active_limit_orders: ActiveLimitOrders { arena: [] }
2025-03-10T19:12:43.423641Z TRACE submit_limit_buy_order_no_position: lfest::order_margin: order_margin_internal: position: Neutral, active_limit_orders: ActiveLimitOrders { arena: [] }
2025-03-10T19:12:43.423881Z TRACE submit_limit_buy_order_no_position: lfest::risk_engine::isolated_margin

failures:
    tests::partial_order_fill::partial_limit_order_fill::with_buy_order
    tests::partial_order_fill::partial_limit_order_fill::with_sell_order
    tests::submit_limit_buy_order::submit_limit_buy_order_no_position
    tests::submit_limit_buy_order::submit_limit_buy_order_with_long
    tests::submit_limit_sell_order::submit_limit_sell_order_no_position

test result: FAILED. 688 passed; 5 failed; 4 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
