*** src/types/smol_currency/base_currency.rs:87:9: replace <impl Currency<I, D> for BaseCurrency<I, D>>::convert_from -> Self with Default::default()

*** mutation diff:
--- src/types/smol_currency/base_currency.rs
+++ replace <impl Currency<I, D> for BaseCurrency<I, D>>::convert_from -> Self with Default::default()
@@ -79,17 +79,17 @@
 impl<I, const D: u8> Currency<I, D> for BaseCurrency<I, D>
 where
     I: Mon<D>,
 {
     // Generic over the decimal points in paired currency.
     type PairedCurrency = QuoteCurrency<I, D>;
 
     fn convert_from(units: Self::PairedCurrency, price_per_unit: QuoteCurrency<I, D>) -> Self {
-        BaseCurrency(*units.as_ref() / *price_per_unit.as_ref())
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Inverse futures where the `Base` currency is used as margin currency.
 ///
 /// # Generics:
 /// - `I`: The numeric data type of `Decimal`.
 /// - `D`: The constant decimal precision of the `BaseCurrency`.

---- position_inner::tests::position_inner_entry_price_inverse::_50_expects stdout ----
2025-03-10T19:11:51.569666Z TRACE lfest::position_inner: new position: qty 50.00000 Quote @ 100.00000 Quote
Assertion failed at src/accounting/transaction.rs:64:9:
  assert!( amount > BaseOrQuote :: zero() )
with expansion:
  BaseCurrency(Decimal(0)) > BaseCurrency(Decimal(0))
Note: Debug output of left and right is identical.
with message:
  The amount of a transaction must be greater than zero


thread 'position_inner::tests::position_inner_entry_price_inverse::_50_expects' panicked at src/accounting/transaction.rs:64:9:
assertion failed

---- position_inner::tests::position_inner_entry_price_inverse::_90_expects stdout ----
2025-03-10T19:11:51.569688Z TRACE lfest::position_inner: new position: qty 90.00000 Quote @ 100.00000 Quote
Assertion failed at src/accounting/transaction.rs:64:9:
  assert!( amount > BaseOrQuote :: zero() )
with expansion:
  BaseCurrency(Decimal(0)) > BaseCurrency(Decimal(0))
Note: Debug output of left and right is identical.
with message:
  The amount of a transaction must be greater than zero


thread 'position_inner::tests::position_inner_entry_price_inverse::_90_expects' panicked at src/accounting/transaction.rs:64:9:
assertion failed

---- position_inner::tests::position_inner_entry_price_inverse::_20_expects stdout ----
2025-03-10T19:11:51.569625Z TRACE lfest::position_inner: new position: qty 20.00000 Quote @ 100.00000 Quote
Assertion failed at src/accounting/transaction.rs:64:9:
  assert!( amount > BaseOrQuote :: zero() )
with expansion:
  BaseCurrency(Decimal(0)) > BaseCurrency(Decimal(0))
Note: Debug output of left and right is identical.
with message:
  The amount of a transaction must be greater than zero


thread 'position_inner::tests::position_inner_entry_price_inverse::_20_expects' panicked at src/accounting/transaction.rs:64:9:
assertion failed

failures:
    position_inner::tests::position_inner_entry_price_inverse::_10_expects
    position_inner::tests::position_inner_entry_price_inverse::_20_expects
    position_inner::tests::position_inner_entry_price_inverse::_50_expects
    position_inner::tests::position_inner_entry_price_inverse::_90_expects
    types::smol_currency::tests::base_currency_pnl
    types::smol_currency::tests::convert_quote_to_base

test result: FAILED. 687 passed; 6 failed; 4 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
