*** src/types/smol_currency/base_currency.rs:141:9: replace <impl One for BaseCurrency<I, D>>::one -> Self with Default::default()

*** mutation diff:
--- src/types/smol_currency/base_currency.rs
+++ replace <impl One for BaseCurrency<I, D>>::one -> Self with Default::default()
@@ -133,17 +133,17 @@
 }
 
 impl<I, const D: u8> One for BaseCurrency<I, D>
 where
     I: Mon<D>,
 {
     #[inline]
     fn one() -> Self {
-        Self(Decimal::one())
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     #[inline]
     fn set_one(&mut self) {
         *self = One::one();
     }
 
     #[inline]

---- order_margin::tests::order_margin_with_short stdout ----
2025-03-10T18:50:27.893233Z TRACE order_margin_with_short: lfest::position_inner: new position: qty 0.00000 Base @ 100.00000 Quote

thread 'order_margin::tests::order_margin_with_short' panicked at src/position_inner.rs:85:9:
assertion failed: quantity > BaseOrQuote::zero()

---- position_inner::tests::position_inner_increase_contracts::_1_expects stdout ----
2025-03-10T18:50:27.894390Z TRACE lfest::position_inner: new position: qty 0.50000 Base @ 100.00000 Quote
2025-03-10T18:50:27.894422Z TRACE lfest::accounting::in_memory_accounting: create_margin_transfer: debit_account_id: USER_POSITION_MARGIN_ACCOUNT, credit_account_id: USER_WALLET_ACCOUNT, amount: 50.00000 Quote
2025-03-10T18:50:27.894432Z DEBUG lfest::position_inner: increase_contracts: qty: 0.50000 Base @ 150.00000 Quote; self: PositionInner( quantity: 0.50000 Base, outstanding_fees: 0.01000 Quote)
2025-03-10T18:50:27.894450Z TRACE lfest::accounting::in_memory_accounting: create_margin_transfer: debit_account_id: USER_POSITION_MARGIN_ACCOUNT, credit_account_id: USER_WALLET_ACCOUNT, amount: 75.00000 Quote

thread 'position_inner::tests::position_inner_increase_contracts::_1_expects' panicked at src/p

---- position_inner::tests::position_inner_increase_contracts::_2_expects stdout ----
2025-03-10T18:50:27.894456Z TRACE lfest::position_inner: new position: qty 0.50000 Base @ 100.00000 Quote
2025-03-10T18:50:27.894494Z TRACE lfest::accounting::in_memory_accounting: create_margin_transfer: debit_account_id: USER_POSITION_MARGIN_ACCOUNT, credit_account_id: USER_WALLET_ACCOUNT, amount: 25.00000 Quote
2025-03-10T18:50:27.894502Z DEBUG lfest::position_inner: increase_contracts: qty: 0.50000 Base @ 150.00000 Quote; self: PositionInner( quantity: 0.50000 Base, outstanding_fees: 0.01000 Quote)
2025-03-10T18:50:27.894550Z TRACE lfest::accounting::in_memory_accounting: create_margin_transfer: debit_account_id: USER_POSITION_MARGIN_ACCOUNT, credit_account_id: USER_WALLET_ACCOUNT, amount: 37.50000 Quote

thread 'position_inner::tests::position_inner_increase_contracts::_2_expects' panicked at src/p

failures:
    order_margin::tests::order_margin_with_short
    position_inner::tests::position_inner_increase_contracts::_1_expects
    position_inner::tests::position_inner_increase_contracts::_2_expects
    position_inner::tests::position_inner_increase_contracts::_5_expects
    risk_engine::isolated_margin::tests::isolated_margin_check_maintenance_margin_short::_2_126_expects
    risk_engine::isolated_margin::tests::isolated_margin_check_maintenance_margin_short::_3_117_expects
    risk_engine::isolated_margin::tests::isolated_margin_check_maintenance_margin_short::_5_111_expects
    tests::cancel_limit_order::cancel_limit_order

test result: FAILED. 684 passed; 8 failed; 4 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
