*** src/market_update/smart_candle.rs:126:9: replace <impl std::fmt::Display for SmartCandle<I, D, BaseOrQuote>>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- src/market_update/smart_candle.rs
+++ replace <impl std::fmt::Display for SmartCandle<I, D, BaseOrQuote>>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -118,23 +118,17 @@
 }
 
 impl<I, const D: u8, BaseOrQuote> std::fmt::Display for SmartCandle<I, D, BaseOrQuote>
 where
     I: Mon<D>,
     BaseOrQuote: Currency<I, D>,
 {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        write!(
-            f,
-            "SmartCandle with {} buy volume levels and {} sell volume levels. last_timestamp_exchange_ns: {}",
-            self.aggregate_buy_volume.len(),
-            self.aggregate_sell_volume.len(),
-            self.last_timestamp_exchange_ns
-        )
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<I, const D: u8, BaseOrQuote> MarketUpdate<I, D, BaseOrQuote> for SmartCandle<I, D, BaseOrQuote>
 where
     I: Mon<D>,
     BaseOrQuote: Currency<I, D>,
 {

*** result: Success
