*** src/types/smol_currency/base_currency.rs:236:21: replace % with + in <impl std::ops::Rem for BaseCurrency<I, D>>::rem

*** mutation diff:
--- src/types/smol_currency/base_currency.rs
+++ replace % with + in <impl std::ops::Rem for BaseCurrency<I, D>>::rem
@@ -228,17 +228,17 @@
 impl<I, const D: u8> std::ops::Rem for BaseCurrency<I, D>
 where
     I: Mon<D>,
 {
     type Output = Self;
 
     #[inline]
     fn rem(self, rhs: Self) -> Self::Output {
-        Self(self.0 % rhs.0)
+        Self(self.0 + /* ~ changed by cargo-mutants ~ */ rhs.0)
     }
 }
 
 impl<I, const D: u8> std::fmt::Display for BaseCurrency<I, D>
 where
     I: Mon<D>,
 {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {

---- tests::amend::amend_limit_order_qty::basecurrency_new_1_0_expects stdout ----
2025-03-10T18:50:44.054444Z TRACE amend_limit_order_qty: lfest::exchange: update_state: market_update: bid: 100.00000 Quote, ask: 101.00000 Quote
2025-03-10T18:50:44.054466Z TRACE amend_limit_order_qty: lfest::exchange: submit_order: user_id: NoUserOrderId, limit Buy 5.00000 Base @ 100.00000 Quote, state: NewOrder

thread 'tests::amend::amend_limit_order_qty::basecurrency_new_1_0_expects' panicked at src/tests/amend.rs:24:48:
called `Result::unwrap()` on an `Err` value: OrderError(InvalidQuantityStepSize)

---- tests::amend::amend_limit_order_qty::basecurrency_new_10_0_expects stdout ----
2025-03-10T18:50:44.054422Z TRACE amend_limit_order_qty: lfest::exchange: update_state: market_update: bid: 100.00000 Quote, ask: 101.00000 Quote
2025-03-10T18:50:44.054443Z TRACE amend_limit_order_qty: lfest::exchange: submit_order: user_id: NoUserOrderId, limit Buy 5.00000 Base @ 100.00000 Quote, state: NewOrder

thread 'tests::amend::amend_limit_order_qty::basecurrency_new_10_0_expects' panicked at src/tests/amend.rs:24:48:
called `Result::unwrap()` on an `Err` value: OrderError(InvalidQuantityStepSize)

---- tests::amend::amend_limit_order_qty::basecurrency_new_5_0_expects stdout ----
2025-03-10T18:50:44.054500Z TRACE amend_limit_order_qty: lfest::exchange: update_state: market_update: bid: 100.00000 Quote, ask: 101.00000 Quote
2025-03-10T18:50:44.054528Z TRACE amend_limit_order_qty: lfest::exchange: submit_order: user_id: NoUserOrderId, limit Buy 5.00000 Base @ 100.00000 Quote, state: NewOrder

thread 'tests::amend::amend_limit_order_qty::basecurrency_new_5_0_expects' panicked at src/tests/amend.rs:24:48:
called `Result::unwrap()` on an `Err` value: OrderError(InvalidQuantityStepSize)

failures:
    tests::amend::amend_limit_order_qty::basecurrency_new_10_0_expects
    tests::amend::amend_limit_order_qty::basecurrency_new_1_0_expects
    tests::amend::amend_limit_order_qty::basecurrency_new_3_0_expects
    tests::amend::amend_limit_order_qty::basecurrency_new_5_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill::basecurrency_new_4_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill::basecurrency_new_5_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill::basecurrency_new_6_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill_leading_to_cancel::basecurrency_new_1_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill_leading_to_cancel::basecurrency_new_2_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill_leading_to_cancel::basecurrency_new_3_0_expects
    tests::cancel_limit_ord

test result: FAILED. 661 passed; 31 failed; 4 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
