*** src/order_filters/price_filter.rs:203:18: replace > with == in enforce_max_price

*** mutation diff:
--- src/order_filters/price_filter.rs
+++ replace > with == in enforce_max_price
@@ -195,17 +195,17 @@
 pub(crate) fn enforce_max_price<I, const D: u8>(
     max_price: Option<QuoteCurrency<I, D>>,
     price: QuoteCurrency<I, D>,
 ) -> Result<(), FilterError>
 where
     I: Mon<D>,
 {
     if let Some(max_price) = max_price {
-        if price > max_price && max_price != QuoteCurrency::zero() {
+        if price == /* ~ changed by cargo-mutants ~ */ max_price && max_price != QuoteCurrency::zero() {
             return Err(FilterError::MarketUpdatePriceTooHigh);
         }
     }
     Ok(())
 }
 
 /// Make sure the price conforms to the step size
 pub(crate) fn enforce_step_size<I, const D: u8>(

*** result: Success
