*** src/order_filters/quantity_filter.rs:98:23: replace - with + in QuantityFilter<I, D, BaseOrQuote>::validate_order_quantity

*** mutation diff:
--- src/order_filters/quantity_filter.rs
+++ replace - with + in QuantityFilter<I, D, BaseOrQuote>::validate_order_quantity
@@ -90,17 +90,17 @@
             if quantity < min_qty {
                 return Err(OrderError::QuantityTooLow);
             }
             min_qty
         } else {
             BaseOrQuote::zero()
         };
 
-        if ((quantity - min_qty) % self.tick_size) != BaseOrQuote::zero() {
+        if ((quantity + /* ~ changed by cargo-mutants ~ */ min_qty) % self.tick_size) != BaseOrQuote::zero() {
             return Err(OrderError::InvalidQuantityStepSize);
         }
         Ok(())
     }
 }
 
 #[cfg(test)]
 mod tests {

*** result: Success
