*** src/order_filters/quantity_filter.rs:98:52: replace != with == in QuantityFilter<I, D, BaseOrQuote>::validate_order_quantity

*** mutation diff:
--- src/order_filters/quantity_filter.rs
+++ replace != with == in QuantityFilter<I, D, BaseOrQuote>::validate_order_quantity
@@ -90,17 +90,17 @@
             if quantity < min_qty {
                 return Err(OrderError::QuantityTooLow);
             }
             min_qty
         } else {
             BaseOrQuote::zero()
         };
 
-        if ((quantity - min_qty) % self.tick_size) != BaseOrQuote::zero() {
+        if ((quantity - min_qty) % self.tick_size) == /* ~ changed by cargo-mutants ~ */ BaseOrQuote::zero() {
             return Err(OrderError::InvalidQuantityStepSize);
         }
         Ok(())
     }
 }
 
 #[cfg(test)]
 mod tests {

---- order_filters::quantity_filter::tests::quantity_filter stdout ----

thread 'order_filters::quantity_filter::tests::quantity_filter' panicked at src/order_filters/quantity_filter.rs:128:14:
called `Result::unwrap()` on an `Err` value: InvalidQuantityStepSize

---- order_filters::quantity_filter::tests::quantity_filter_2 stdout ----

thread 'order_filters::quantity_filter::tests::quantity_filter_2' panicked at src/order_filters/quantity_filter.rs:158:9:
assertion `left == right` failed
  left: Ok(())
 right: Err(InvalidQuantityStepSize)

---- tests::amend::amend_limit_order_qty_with_partial_fill::basecurrency_new_6_0_expects stdout ----
2025-03-10T19:12:18.309181Z TRACE amend_limit_order_qty_with_partial_fill: lfest::exchange: update_state: market_update: bid: 100.00000 Quote, ask: 101.00000 Quote
2025-03-10T19:12:18.309213Z TRACE amend_limit_order_qty_with_partial_fill: lfest::exchange: submit_order: user_id: NoUserOrderId, limit Buy 5.00000 Base @ 100.00000 Quote, state: NewOrder

thread 'tests::amend::amend_limit_order_qty_with_partial_fill::basecurrency_new_6_0_expects' panicked at src/tests/amend.rs:109:48:
called `Result::unwrap()` on an `Err` value: OrderError(InvalidQuantityStepSize)

failures:
    order_filters::quantity_filter::tests::quantity_filter
    order_filters::quantity_filter::tests::quantity_filter_2
    tests::amend::amend_limit_order_qty::basecurrency_new_10_0_expects
    tests::amend::amend_limit_order_qty::basecurrency_new_1_0_expects
    tests::amend::amend_limit_order_qty::basecurrency_new_3_0_expects
    tests::amend::amend_limit_order_qty::basecurrency_new_5_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill::basecurrency_new_4_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill::basecurrency_new_5_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill::basecurrency_new_6_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill_leading_to_cancel::basecurrency_new_1_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill_leading_to_cancel::basecurrency_new_2_0_expects
    tests::am

test result: FAILED. 660 passed; 33 failed; 4 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
