*** src/order_margin.rs:152:23: replace += with *= in OrderMargin<I, D, BaseOrQuote, UserOrderIdT>::order_margin_internal

*** mutation diff:
--- src/order_margin.rs
+++ replace += with *= in OrderMargin<I, D, BaseOrQuote, UserOrderIdT>::order_margin_internal
@@ -144,17 +144,17 @@
                 while outstanding_pos_qty > BaseOrQuote::zero() {
                     if i >= buy_orders.len() {
                         break;
                     }
                     let new_qty = max(buy_orders[i].1 - outstanding_pos_qty, BaseOrQuote::zero());
                     trace!("buys order_qty: {}, outstanding_pos_qty: {outstanding_pos_qty} new_qty: {new_qty}", buy_orders[i].1);
                     outstanding_pos_qty -= min(buy_orders[i].1, outstanding_pos_qty);
                     buy_orders[i].1 = new_qty;
-                    i += 1;
+                    i *= /* ~ changed by cargo-mutants ~ */ 1;
                 }
             }
         }
 
         let mut buy_value = BaseOrQuote::PairedCurrency::zero();
         buy_orders.iter().for_each(|(price, qty)| {
             buy_value += BaseOrQuote::PairedCurrency::convert_from(*qty, *price)
         });

*** result: Success
