*** src/order_margin.rs:159:23: replace += with -= in OrderMargin<I, D, BaseOrQuote, UserOrderIdT>::order_margin_internal

*** mutation diff:
--- src/order_margin.rs
+++ replace += with -= in OrderMargin<I, D, BaseOrQuote, UserOrderIdT>::order_margin_internal
@@ -151,17 +151,17 @@
                     buy_orders[i].1 = new_qty;
                     i += 1;
                 }
             }
         }
 
         let mut buy_value = BaseOrQuote::PairedCurrency::zero();
         buy_orders.iter().for_each(|(price, qty)| {
-            buy_value += BaseOrQuote::PairedCurrency::convert_from(*qty, *price)
+            buy_value -= /* ~ changed by cargo-mutants ~ */ BaseOrQuote::PairedCurrency::convert_from(*qty, *price)
         });
 
         let mut sell_value = BaseOrQuote::PairedCurrency::zero();
         sell_orders.iter().for_each(|(price, qty)| {
             sell_value += BaseOrQuote::PairedCurrency::convert_from(*qty, *price)
         });
 
         max(buy_value, sell_value) * init_margin_req

---- order_margin::tests::order_margin_neutral_orders_of_same_side::_1_side_buy_100_1_2_expects stdout ----

thread 'order_margin::tests::order_margin_neutral_orders_of_same_side::_1_side_buy_100_1_2_expects' panicked at src/order_margin.rs:291:9:
assertion `left == right` failed
  left: QuoteCurrency(Decimal(0))
 right: QuoteCurrency(Decimal(2000000))

---- order_margin::tests::order_margin_neutral_orders_of_same_side::_1_side_buy_100_1_3_expects stdout ----

thread 'order_margin::tests::order_margin_neutral_orders_of_same_side::_1_side_buy_100_1_3_expects' panicked at src/order_margin.rs:291:9:
assertion `left == right` failed
  left: QuoteCurrency(Decimal(0))
 right: QuoteCurrency(Decimal(3000000))

---- order_margin::tests::order_margin_neutral_orders_of_same_side::_1_side_buy_100_2_1_expects stdout ----

thread 'order_margin::tests::order_margin_neutral_orders_of_same_side::_1_side_buy_100_2_1_expects' panicked at src/order_margin.rs:291:9:
assertion `left == right` failed
  left: QuoteCurrency(Decimal(0))
 right: QuoteCurrency(Decimal(2000000))

failures:
    order_margin::tests::order_margin_neutral_orders_of_same_side::_1_side_buy_100_1_1_expects
    order_margin::tests::order_margin_neutral_orders_of_same_side::_1_side_buy_100_1_2_expects
    order_margin::tests::order_margin_neutral_orders_of_same_side::_1_side_buy_100_1_3_expects
    order_margin::tests::order_margin_neutral_orders_of_same_side::_1_side_buy_100_2_1_expects
    order_margin::tests::order_margin_neutral_orders_of_same_side::_1_side_buy_100_2_2_expects
    order_margin::tests::order_margin_neutral_orders_of_same_side::_1_side_buy_100_2_3_expects
    order_margin::tests::order_margin_neutral_orders_of_same_side::_1_side_buy_100_3_1_expects
    order_margin::tests::order_margin_neutral_orders_of_same_side::_1_side_buy_100_3_2_expects
    order_margin::tests::order_margin_neutral_orders_of_same_side::_1_side_buy_100_3_3_expects
    order_margin::tests::order_marg

test result: FAILED. 579 passed; 114 failed; 4 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
