*** src/position.rs:49:9: replace Position<I, D, BaseOrQuote>::quantity -> BaseOrQuote with Default::default()

*** mutation diff:
--- src/position.rs
+++ replace Position<I, D, BaseOrQuote>::quantity -> BaseOrQuote with Default::default()
@@ -41,21 +41,17 @@
             Position::Neutral => BaseOrQuote::PairedCurrency::zero(),
             Position::Long(inner) => inner.unrealized_pnl(bid),
             Position::Short(inner) => inner.unrealized_pnl(ask).neg(),
         }
     }
 
     /// The quantity of the position, is negative when short.
     pub fn quantity(&self) -> BaseOrQuote {
-        match self {
-            Position::Neutral => BaseOrQuote::zero(),
-            Position::Long(inner) => inner.quantity(),
-            Position::Short(inner) => inner.quantity().neg(),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the outstanding fees of the position that will be payed when reducing the position.
     pub fn outstanding_fees(&self) -> BaseOrQuote::PairedCurrency {
         match self {
             Position::Neutral => BaseOrQuote::PairedCurrency::zero(),
             Position::Long(inner) => inner.outstanding_fees(),
             Position::Short(inner) => inner.outstanding_fees(),

---- inv_long_market_loss_partial stdout ----
2025-03-10T19:11:56.579865Z TRACE inv_long_market_loss_partial: lfest::exchange: update_state: market_update: bid: 999.00000 Quote, ask: 1000.00000 Quote
2025-03-10T19:11:56.580121Z TRACE inv_long_market_loss_partial: lfest::exchange: update_state: market_update: bid: 999.00000 Quote, ask: 1000.00000 Quote
2025-03-10T19:11:56.580130Z TRACE inv_long_market_loss_partial: lfest::position_inner: new position: qty 800.00000 Quote @ 1000.00000 Quote
2025-03-10T19:11:56.580188Z TRACE inv_long_market_loss_partial: lfest::exchange: update_state: market_update: bid: 800.00000 Quote, ask: 801.00000 Quote
2025-03-10T19:11:56.580650Z TRACE inv_long_market_loss_partial: lfest::exchange: update_state: market_update: bid: 800.00000 Quote, ask: 801.00000 Quote

thread 'inv_long_market_loss_partial' panicked at tests/inverse_futures.rs:570:5:

---- inv_long_market_win_partial stdout ----
2025-03-10T19:11:56.579896Z TRACE inv_long_market_win_partial: lfest::exchange: update_state: market_update: bid: 999.00000 Quote, ask: 1000.00000 Quote
2025-03-10T19:11:56.580234Z TRACE inv_long_market_win_partial: lfest::exchange: update_state: market_update: bid: 1000.00000 Quote, ask: 1001.00000 Quote
2025-03-10T19:11:56.580549Z TRACE inv_long_market_win_partial: lfest::position_inner: new position: qty 800.00000 Quote @ 1000.00000 Quote
2025-03-10T19:11:56.580642Z TRACE inv_long_market_win_partial: lfest::exchange: update_state: market_update: bid: 2000.00000 Quote, ask: 2001.00000 Quote
2025-03-10T19:11:56.581115Z TRACE inv_long_market_win_partial: lfest::exchange: update_state: market_update: bid: 2000.00000 Quote, ask: 2001.00000 Quote

thread 'inv_long_market_win_partial' panicked at tests/inverse_futures.rs:475:5:

failures:
    inv_long_market_loss_partial
    inv_long_market_win_partial

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
