*** src/position_inner.rs:116:9: replace PositionInner<I, D, BaseOrQuote>::unrealized_pnl -> BaseOrQuote::PairedCurrency with Default::default()

*** mutation diff:
--- src/position_inner.rs
+++ replace PositionInner<I, D, BaseOrQuote>::unrealized_pnl -> BaseOrQuote::PairedCurrency with Default::default()
@@ -108,17 +108,17 @@
 
     /// Return the positions unrealized profit and loss
     /// denoted in QUOTE when using linear futures,
     /// denoted in BASE when using inverse futures
     pub fn unrealized_pnl(
         &self,
         mark_to_market_price: QuoteCurrency<I, D>,
     ) -> BaseOrQuote::PairedCurrency {
-        BaseOrQuote::PairedCurrency::pnl(self.entry_price(), mark_to_market_price, self.quantity)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Add contracts to the position.
     pub(crate) fn increase_contracts<Acc>(
         &mut self,
         qty: BaseOrQuote,
         entry_price: QuoteCurrency<I, D>,
         accounting: &mut Acc,

---- inv_short_market_win_partial stdout ----
2025-03-10T19:12:07.200277Z TRACE inv_short_market_win_partial: lfest::exchange: update_state: market_update: bid: 1000.00000 Quote, ask: 1001.00000 Quote
2025-03-10T19:12:07.200500Z TRACE inv_short_market_win_partial: lfest::exchange: update_state: market_update: bid: 999.00000 Quote, ask: 1000.00000 Quote
2025-03-10T19:12:07.200507Z TRACE inv_short_market_win_partial: lfest::position_inner: new position: qty 800.00000 Quote @ 1000.00000 Quote
2025-03-10T19:12:07.200523Z TRACE inv_short_market_win_partial: lfest::exchange: update_state: market_update: bid: 799.00000 Quote, ask: 800.00000 Quote

thread 'inv_short_market_win_partial' panicked at tests/inverse_futures.rs:659:5:
assertion `left == right` failed
  left: BaseCurrency(Decimal(0))
 right: BaseCurrency(Decimal(20000))

---- inv_long_market_win_partial stdout ----
2025-03-10T19:12:07.200277Z TRACE inv_long_market_win_partial: lfest::exchange: update_state: market_update: bid: 999.00000 Quote, ask: 1000.00000 Quote
2025-03-10T19:12:07.200556Z TRACE inv_long_market_win_partial: lfest::exchange: update_state: market_update: bid: 1000.00000 Quote, ask: 1001.00000 Quote
2025-03-10T19:12:07.200563Z TRACE inv_long_market_win_partial: lfest::position_inner: new position: qty 800.00000 Quote @ 1000.00000 Quote
2025-03-10T19:12:07.200634Z TRACE inv_long_market_win_partial: lfest::exchange: update_state: market_update: bid: 2000.00000 Quote, ask: 2001.00000 Quote

thread 'inv_long_market_win_partial' panicked at tests/inverse_futures.rs:454:5:
assertion `left == right` failed
  left: BaseCurrency(Decimal(0))
 right: BaseCurrency(Decimal(40000))

---- inv_long_market_loss_full stdout ----
2025-03-10T19:12:07.200273Z TRACE inv_long_market_loss_full: lfest::exchange: update_state: market_update: bid: 999.00000 Quote, ask: 1000.00000 Quote
2025-03-10T19:12:07.200505Z TRACE inv_long_market_loss_full: lfest::position_inner: new position: qty 800.00000 Quote @ 1000.00000 Quote
2025-03-10T19:12:07.200521Z TRACE inv_long_market_loss_full: lfest::exchange: update_state: market_update: bid: 800.00000 Quote, ask: 801.00000 Quote

thread 'inv_long_market_loss_full' panicked at tests/inverse_futures.rs:169:5:
assertion `left == right` failed
  left: BaseCurrency(Decimal(0))
 right: BaseCurrency(Decimal(-20000))

failures:
    inv_long_market_loss_full
    inv_long_market_loss_partial
    inv_long_market_win_full
    inv_long_market_win_partial
    inv_short_market_win_full
    inv_short_market_win_partial

test result: FAILED. 4 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
