*** src/types/smol_currency/quote_currency.rs:103:39: replace * with / in <impl Currency<I, D> for QuoteCurrency<I, D>>::convert_from

*** mutation diff:
--- src/types/smol_currency/quote_currency.rs
+++ replace * with / in <impl Currency<I, D> for QuoteCurrency<I, D>>::convert_from
@@ -95,17 +95,17 @@
 /// - `D`: The constant decimal precision of the `QuoteCurrency`.
 impl<I, const D: u8> Currency<I, D> for QuoteCurrency<I, D>
 where
     I: Mon<D>,
 {
     type PairedCurrency = BaseCurrency<I, D>;
 
     fn convert_from(units: Self::PairedCurrency, price_per_unit: QuoteCurrency<I, D>) -> Self {
-        QuoteCurrency(*units.as_ref() * *price_per_unit.as_ref())
+        QuoteCurrency(*units.as_ref() / /* ~ changed by cargo-mutants ~ */ *price_per_unit.as_ref())
     }
 }
 
 /// Linear futures where the `Quote` currency is used as margin currency.
 ///
 /// # Generics:
 /// - `I`: The numeric data type of `Decimal`.
 /// - `D`: The constant decimal precision.

---- position_inner::tests::position_inner_increase_contracts::_1_expects stdout ----
2025-03-10T19:12:14.378103Z TRACE lfest::position_inner: new position: qty 0.50000 Base @ 100.00000 Quote
2025-03-10T19:12:14.378154Z TRACE lfest::accounting::in_memory_accounting: create_margin_transfer: debit_account_id: USER_POSITION_MARGIN_ACCOUNT, credit_account_id: USER_WALLET_ACCOUNT, amount: 0.00500 Quote
2025-03-10T19:12:14.378173Z DEBUG lfest::position_inner: increase_contracts: qty: 0.50000 Base @ 150.00000 Quote; self: PositionInner( quantity: 0.50000 Base, outstanding_fees: 0.00000 Quote)
2025-03-10T19:12:14.378213Z TRACE lfest::accounting::in_memory_accounting: create_margin_transfer: debit_account_id: USER_POSITION_MARGIN_ACCOUNT, credit_account_id: USER_WALLET_ACCOUNT, amount: 0.00333 Quote

thread 'position_inner::tests::position_inner_increase_contracts::_1_expects' panicked at src/pos

---- position_inner::tests::position_inner_increase_contracts::_2_expects stdout ----
2025-03-10T19:12:14.378137Z TRACE lfest::position_inner: new position: qty 0.50000 Base @ 100.00000 Quote
2025-03-10T19:12:14.378228Z TRACE lfest::accounting::in_memory_accounting: create_margin_transfer: debit_account_id: USER_POSITION_MARGIN_ACCOUNT, credit_account_id: USER_WALLET_ACCOUNT, amount: 0.00250 Quote
2025-03-10T19:12:14.378239Z DEBUG lfest::position_inner: increase_contracts: qty: 0.50000 Base @ 150.00000 Quote; self: PositionInner( quantity: 0.50000 Base, outstanding_fees: 0.00000 Quote)
2025-03-10T19:12:14.378371Z TRACE lfest::accounting::in_memory_accounting: create_margin_transfer: debit_account_id: USER_POSITION_MARGIN_ACCOUNT, credit_account_id: USER_WALLET_ACCOUNT, amount: 0.00166 Quote

thread 'position_inner::tests::position_inner_increase_contracts::_2_expects' panicked at src/pos

---- position_inner::tests::position_inner_new::_2_expects stdout ----
2025-03-10T19:12:14.378236Z TRACE lfest::position_inner: new position: qty 0.50000 Base @ 100.00000 Quote
2025-03-10T19:12:14.378357Z TRACE lfest::accounting::in_memory_accounting: create_margin_transfer: debit_account_id: USER_POSITION_MARGIN_ACCOUNT, credit_account_id: USER_WALLET_ACCOUNT, amount: 0.00250 Quote

thread 'position_inner::tests::position_inner_new::_2_expects' panicked at src/position_inner.rs:257:9:
assertion `left == right` failed
  left: QuoteCurrency(Decimal(250))
 right: QuoteCurrency(Decimal(2500000))

failures:
    order_margin::tests::order_margin_no_position
    order_margin::tests::order_margin_with_long
    order_margin::tests::order_margin_with_short
    position_inner::tests::position_inner_decrease_contracts_2::_1_side_buy_expects
    position_inner::tests::position_inner_decrease_contracts_2::_1_side_sell_expects
    position_inner::tests::position_inner_decrease_contracts_2::_2_side_buy_expects
    position_inner::tests::position_inner_decrease_contracts_2::_2_side_sell_expects
    position_inner::tests::position_inner_decrease_contracts_2::_5_side_buy_expects
    position_inner::tests::position_inner_decrease_contracts_2::_5_side_sell_expects
    position_inner::tests::position_inner_decrease_contracts_basic::_1_expects
    position_inner::tests::position_inner_decrease_contracts_basic::_2_expects
    position_inner::tests::position_inner_decrease_contracts_basic::_5_expects

test result: FAILED. 650 passed; 43 failed; 4 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
