*** src/types/smol_currency/quote_currency.rs:159:9: replace <impl One for QuoteCurrency<I, D>>::one -> Self with Default::default()

*** mutation diff:
--- src/types/smol_currency/quote_currency.rs
+++ replace <impl One for QuoteCurrency<I, D>>::one -> Self with Default::default()
@@ -151,17 +151,17 @@
 }
 
 impl<I, const D: u8> One for QuoteCurrency<I, D>
 where
     I: Mon<D>,
 {
     #[inline]
     fn one() -> Self {
-        Self(Decimal::<I, D>::try_from_scaled(I::one(), 0).unwrap())
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     #[inline]
     fn set_one(&mut self) {
         *self = One::one();
     }
 
     #[inline]

---- order_filters::quantity_filter::tests::quantity_filter_2 stdout ----

thread 'order_filters::quantity_filter::tests::quantity_filter_2' panicked at /home/magewe/.cargo/git/checkouts/const-decimal-6cfeb2585da3f984/7bf77bf/src/decimal.rs:227:41:
called `Option::unwrap()` on a `None` value

---- order_filters::quantity_filter::tests::quantity_filter stdout ----

thread 'order_filters::quantity_filter::tests::quantity_filter' panicked at /home/magewe/.cargo/git/checkouts/const-decimal-6cfeb2585da3f984/7bf77bf/src/decimal.rs:227:41:
called `Option::unwrap()` on a `None` value

---- risk_engine::isolated_margin::tests::isolated_margin_check_maintenance_margin_long::_2_75_expects stdout ----
2025-03-10T19:12:01.957443Z TRACE lfest::position_inner: new position: qty 1.00000 Base @ 100.00000 Quote
2025-03-10T19:12:01.957512Z TRACE lfest::position_inner: new position: qty 1.00000 Base @ 100.00000 Quote

thread 'risk_engine::isolated_margin::tests::isolated_margin_check_maintenance_margin_long::_2_75_expects' panicked at src/risk_engine/isolated_margin.rs:334:9:
assertion `left == right` failed
  left: Ok(())
 right: Err(Liquidate)

failures:
    order_filters::quantity_filter::tests::quantity_filter
    order_filters::quantity_filter::tests::quantity_filter_2
    risk_engine::isolated_margin::tests::isolated_margin_check_maintenance_margin_long::_2_75_expects
    risk_engine::isolated_margin::tests::isolated_margin_check_maintenance_margin_long::_3_84_expects
    risk_engine::isolated_margin::tests::isolated_margin_check_maintenance_margin_long::_5_90_expects
    risk_engine::isolated_margin::tests::isolated_margin_check_maintenance_margin_short::_2_126_expects
    risk_engine::isolated_margin::tests::isolated_margin_check_maintenance_margin_short::_3_117_expects
    risk_engine::isolated_margin::tests::isolated_margin_check_maintenance_margin_short::_5_111_expects

test result: FAILED. 685 passed; 8 failed; 4 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
