*** src/load_trades_from_csv.rs:54:43: replace * with / in load_trades_from_csv

*** mutation diff:
--- src/load_trades_from_csv.rs
+++ replace * with / in load_trades_from_csv
@@ -46,15 +46,15 @@
             Side::Buy
         };
 
         // convert to Trade
         let trade = Trade {
             price: QuoteCurrency::from(price),
             quantity: QuoteCurrency::from(quantity),
             side,
-            timestamp_exchange_ns: (ts_ms * 1_000_000).into(),
+            timestamp_exchange_ns: (ts_ms / /* ~ changed by cargo-mutants ~ */ 1_000_000).into(),
         };
         out.push(trade);
     }
 
     out
 }

*** result: Success
