*** src/market_update/smart_candle.rs:191:9: replace <impl MarketUpdate<I, D, BaseOrQuote> for SmartCandle<I, D, BaseOrQuote>>::update_market_state with ()

*** mutation diff:
--- src/market_update/smart_candle.rs
+++ replace <impl MarketUpdate<I, D, BaseOrQuote> for SmartCandle<I, D, BaseOrQuote>>::update_market_state with ()
@@ -183,18 +183,17 @@
     ) -> crate::Result<()> {
         // The constructor checks the validity when debug assertions are enabled.
         Ok(())
     }
 
     // Basically whatever the user inputs as the best bid and ask.
     #[inline]
     fn update_market_state(&self, market_state: &mut crate::prelude::MarketState<I, D>) {
-        market_state.set_bid(self.bba.bid);
-        market_state.set_ask(self.bba.ask);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     #[inline(always)]
     fn timestamp_exchange_ns(&self) -> crate::prelude::TimestampNs {
         self.last_timestamp_exchange_ns
     }
 }

*** result: Success
