*** src/market_update/trade_update.rs:66:37: replace < with > in <impl MarketUpdate<I, D, BaseOrQuote> for Trade<I, D, BaseOrQuote>>::limit_order_filled

*** mutation diff:
--- src/market_update/trade_update.rs
+++ replace < with > in <impl MarketUpdate<I, D, BaseOrQuote> for Trade<I, D, BaseOrQuote>>::limit_order_filled
@@ -58,17 +58,17 @@
             self.quantity > BaseOrQuote::zero(),
             "The trade quantity must be greater than zero."
         );
         debug_assert!(order.remaining_quantity() > BaseOrQuote::zero());
 
         // Notice that the limit order price must be strictly lower or higher than the limit order price,
         // because we assume the limit order has the worst possible queue position in the book.
         if match order.side() {
-            Side::Buy => self.price < order.limit_price() && matches!(self.side, Side::Sell),
+            Side::Buy => self.price > /* ~ changed by cargo-mutants ~ */ order.limit_price() && matches!(self.side, Side::Sell),
             Side::Sell => self.price > order.limit_price() && matches!(self.side, Side::Buy),
         } {
             // Execute up to the quantity of the incoming `Trade`.
             let filled_qty = min(self.quantity, order.remaining_quantity());
             Some(filled_qty)
         } else {
             None
         }

---- market_update::trade_update::tests::trade_limit_order_filled_none::_100_1_side_sell_expects stdout ----

thread 'market_update::trade_update::tests::trade_limit_order_filled_none::_100_1_side_sell_expects' panicked at src/market_update/trade_update.rs:153:52:
called `Option::unwrap()` on a `None` value

---- market_update::trade_update::tests::trade_limit_order_filled_none::_100_2_side_sell_expects stdout ----

thread 'market_update::trade_update::tests::trade_limit_order_filled_none::_100_2_side_sell_expects' panicked at src/market_update/trade_update.rs:153:52:
called `Option::unwrap()` on a `None` value

---- market_update::trade_update::tests::trade_limit_order_filled_none::_100_3_side_sell_expects stdout ----

thread 'market_update::trade_update::tests::trade_limit_order_filled_none::_100_3_side_sell_expects' panicked at src/market_update/trade_update.rs:153:52:
called `Option::unwrap()` on a `None` value

failures:
    market_update::trade_update::tests::trade_limit_order_filled_none::_100_1_side_sell_expects
    market_update::trade_update::tests::trade_limit_order_filled_none::_100_2_side_sell_expects
    market_update::trade_update::tests::trade_limit_order_filled_none::_100_3_side_sell_expects
    market_update::trade_update::tests::trade_limit_order_filled_none::_110_1_side_sell_expects
    market_update::trade_update::tests::trade_limit_order_filled_none::_110_2_side_sell_expects
    market_update::trade_update::tests::trade_limit_order_filled_none::_110_3_side_sell_expects
    market_update::trade_update::tests::trade_limit_order_filled_none::_120_1_side_sell_expects
    market_update::trade_update::tests::trade_limit_order_filled_none::_120_2_side_sell_expects
    market_update::trade_update::tests::trade_limit_order_filled_none::_120_3_side_sell_expects
    market_update::trade_u

test result: FAILED. 664 passed; 28 failed; 4 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
