*** src/order_filters/price_filter.rs:130:28: replace > with == in PriceFilter<I, D>::validate_limit_price

*** mutation diff:
--- src/order_filters/price_filter.rs
+++ replace > with == in PriceFilter<I, D>::validate_limit_price
@@ -122,17 +122,17 @@
         limit_price: QuoteCurrency<I, D>,
         mark_price: QuoteCurrency<I, D>,
     ) -> Result<(), OrderError> {
         if limit_price <= QuoteCurrency::zero() {
             return Err(OrderError::LimitPriceBelowMin);
         }
 
         if let Some(max_price) = self.max_price {
-            if limit_price > max_price {
+            if limit_price == /* ~ changed by cargo-mutants ~ */ max_price {
                 return Err(OrderError::LimitPriceAboveMax);
             }
         }
 
         let min_price = if let Some(min_price) = self.min_price {
             if limit_price < min_price {
                 return Err(OrderError::LimitPriceBelowMin);
             }

---- order_filters::price_filter::tests::price_filter stdout ----

thread 'order_filters::price_filter::tests::price_filter' panicked at src/order_filters/price_filter.rs:256:9:
assertion `left == right` failed
  left: Err(LimitPriceAboveMultiple)
 right: Err(LimitPriceAboveMax)

failures:
    order_filters::price_filter::tests::price_filter

test result: FAILED. 691 passed; 1 failed; 4 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
