*** src/order_filters/price_filter.rs:150:58: replace && with || in PriceFilter<I, D>::validate_limit_price

*** mutation diff:
--- src/order_filters/price_filter.rs
+++ replace && with || in PriceFilter<I, D>::validate_limit_price
@@ -142,17 +142,17 @@
         };
 
         if ((limit_price - min_price) % self.tick_size) != QuoteCurrency::zero() {
             return Err(OrderError::InvalidOrderPriceStepSize {
                 limit_price: limit_price.to_string(),
                 step_size: self.tick_size.to_string(),
             });
         }
-        if limit_price > mark_price * self.multiplier_up && self.multiplier_up != Decimal::zero() {
+        if limit_price > mark_price * self.multiplier_up || /* ~ changed by cargo-mutants ~ */ self.multiplier_up != Decimal::zero() {
             return Err(OrderError::LimitPriceAboveMultiple);
         }
         if limit_price < mark_price * self.multiplier_down
             && self.multiplier_down != Decimal::zero()
         {
             return Err(OrderError::LimitPriceBelowMultiple);
         }
         Ok(())

---- order_filters::price_filter::tests::price_filter stdout ----

thread 'order_filters::price_filter::tests::price_filter' panicked at src/order_filters/price_filter.rs:245:56:
called `Result::unwrap()` on an `Err` value: LimitPriceAboveMultiple

---- tests::amend::amend_limit_order_qty_with_partial_fill::basecurrency_new_4_0_expects stdout ----
2025-03-10T18:51:08.211114Z TRACE amend_limit_order_qty_with_partial_fill: lfest::exchange: update_state: market_update: bid: 100.00000 Quote, ask: 101.00000 Quote
2025-03-10T18:51:08.211135Z TRACE amend_limit_order_qty_with_partial_fill: lfest::exchange: submit_order: user_id: NoUserOrderId, limit Buy 5.00000 Base @ 100.00000 Quote, state: NewOrder

thread 'tests::amend::amend_limit_order_qty_with_partial_fill::basecurrency_new_4_0_expects' panicked at src/tests/amend.rs:109:48:
called `Result::unwrap()` on an `Err` value: OrderError(LimitPriceAboveMultiple)

---- tests::amend::amend_limit_order_qty::basecurrency_new_1_0_expects stdout ----
2025-03-10T18:51:08.211094Z TRACE amend_limit_order_qty: lfest::exchange: update_state: market_update: bid: 100.00000 Quote, ask: 101.00000 Quote
2025-03-10T18:51:08.211127Z TRACE amend_limit_order_qty: lfest::exchange: submit_order: user_id: NoUserOrderId, limit Buy 5.00000 Base @ 100.00000 Quote, state: NewOrder

thread 'tests::amend::amend_limit_order_qty::basecurrency_new_1_0_expects' panicked at src/tests/amend.rs:24:48:
called `Result::unwrap()` on an `Err` value: OrderError(LimitPriceAboveMultiple)

failures:
    order_filters::price_filter::tests::price_filter
    tests::amend::amend_limit_order_qty::basecurrency_new_10_0_expects
    tests::amend::amend_limit_order_qty::basecurrency_new_1_0_expects
    tests::amend::amend_limit_order_qty::basecurrency_new_3_0_expects
    tests::amend::amend_limit_order_qty::basecurrency_new_5_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill::basecurrency_new_4_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill::basecurrency_new_5_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill::basecurrency_new_6_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill_leading_to_cancel::basecurrency_new_1_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill_leading_to_cancel::basecurrency_new_2_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill_leading_to_cancel::bas

test result: FAILED. 670 passed; 22 failed; 4 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
