*** src/order_margin.rs:134:56: replace - with + in OrderMargin<I, D, BaseOrQuote, UserOrderIdT>::order_margin_internal

*** mutation diff:
--- src/order_margin.rs
+++ replace - with + in OrderMargin<I, D, BaseOrQuote, UserOrderIdT>::order_margin_internal
@@ -126,17 +126,17 @@
             Position::Neutral => {}
             Position::Long(inner) => {
                 let mut outstanding_pos_qty = inner.quantity();
                 let mut i = 0;
                 while outstanding_pos_qty > BaseOrQuote::zero() {
                     if i >= sell_orders.len() {
                         break;
                     }
-                    let new_qty = max(sell_orders[i].1 - outstanding_pos_qty, BaseOrQuote::zero());
+                    let new_qty = max(sell_orders[i].1 + /* ~ changed by cargo-mutants ~ */ outstanding_pos_qty, BaseOrQuote::zero());
                     trace!("sells order_qty: {}, outstanding_pos_qty: {outstanding_pos_qty} new_qty: {new_qty}", sell_orders[i].1);
                     outstanding_pos_qty -= min(sell_orders[i].1, outstanding_pos_qty);
                     sell_orders[i].1 = new_qty;
                     i += 1;
                 }
             }
             Position::Short(inner) => {
                 let mut outstanding_pos_qty = inner.quantity();

---- order_margin::tests::order_margin_long_orders_of_same_qty::_1_side_sell_110_3_100_expects stdout ----

thread 'order_margin::tests::order_margin_long_orders_of_same_qty::_1_side_sell_110_3_100_expects' panicked at src/order_margin.rs:421:9:
assertion `left == right` failed: The position quantity always cancels out the limit orders. So margin requirement is 0.
  left: QuoteCurrency(Decimal(6600000))
 right: QuoteCurrency(Decimal(0))

---- order_margin::tests::order_margin_long_orders_of_same_qty::_1_side_sell_110_1_100_expects stdout ----

thread 'order_margin::tests::order_margin_long_orders_of_same_qty::_1_side_sell_110_1_100_expects' panicked at src/order_margin.rs:421:9:
assertion `left == right` failed: The position quantity always cancels out the limit orders. So margin requirement is 0.
  left: QuoteCurrency(Decimal(2200000))
 right: QuoteCurrency(Decimal(0))

---- order_margin::tests::order_margin_long_orders_of_same_qty::_1_side_sell_110_1_125_expects stdout ----

thread 'order_margin::tests::order_margin_long_orders_of_same_qty::_1_side_sell_110_1_125_expects' panicked at src/order_margin.rs:421:9:
assertion `left == right` failed: The position quantity always cancels out the limit orders. So margin requirement is 0.
  left: QuoteCurrency(Decimal(2200000))
 right: QuoteCurrency(Decimal(0))

failures:
    order_margin::tests::order_margin_long_orders_of_same_qty::_1_side_sell_110_1_100_expects
    order_margin::tests::order_margin_long_orders_of_same_qty::_1_side_sell_110_1_125_expects
    order_margin::tests::order_margin_long_orders_of_same_qty::_1_side_sell_110_1_85_expects
    order_margin::tests::order_margin_long_orders_of_same_qty::_1_side_sell_110_2_100_expects
    order_margin::tests::order_margin_long_orders_of_same_qty::_1_side_sell_110_2_125_expects
    order_margin::tests::order_margin_long_orders_of_same_qty::_1_side_sell_110_2_85_expects
    order_margin::tests::order_margin_long_orders_of_same_qty::_1_side_sell_110_3_100_expects
    order_margin::tests::order_margin_long_orders_of_same_qty::_1_side_sell_110_3_125_expects
    order_margin::tests::order_margin_long_orders_of_same_qty::_1_side_sell_110_3_85_expects
    order_margin::tests::order_margin_long_orde

test result: FAILED. 608 passed; 84 failed; 4 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
