*** src/order_margin.rs:150:41: replace -= with += in OrderMargin<I, D, BaseOrQuote, UserOrderIdT>::order_margin_internal

*** mutation diff:
--- src/order_margin.rs
+++ replace -= with += in OrderMargin<I, D, BaseOrQuote, UserOrderIdT>::order_margin_internal
@@ -142,17 +142,17 @@
                 let mut outstanding_pos_qty = inner.quantity();
                 let mut i = 0;
                 while outstanding_pos_qty > BaseOrQuote::zero() {
                     if i >= buy_orders.len() {
                         break;
                     }
                     let new_qty = max(buy_orders[i].1 - outstanding_pos_qty, BaseOrQuote::zero());
                     trace!("buys order_qty: {}, outstanding_pos_qty: {outstanding_pos_qty} new_qty: {new_qty}", buy_orders[i].1);
-                    outstanding_pos_qty -= min(buy_orders[i].1, outstanding_pos_qty);
+                    outstanding_pos_qty += /* ~ changed by cargo-mutants ~ */ min(buy_orders[i].1, outstanding_pos_qty);
                     buy_orders[i].1 = new_qty;
                     i += 1;
                 }
             }
         }
 
         let mut buy_value = BaseOrQuote::PairedCurrency::zero();
         buy_orders.iter().for_each(|(price, qty)| {

*** result: Success
