*** src/order_rate_limiter.rs:54:27: replace == with != in OrderRateLimiter::aquire

*** mutation diff:
--- src/order_rate_limiter.rs
+++ replace == with != in OrderRateLimiter::aquire
@@ -46,17 +46,17 @@
     /// returns `true` if the rate limit has been reached.
     #[inline(always)]
     pub(crate) fn aquire(&mut self, current_ts_ns: TimestampNs) -> crate::Result<()> {
         if !self.is_in_bucket(current_ts_ns) {
             self.new_bucket(current_ts_ns);
             self.remaining -= 1;
             return Ok(());
         }
-        if self.remaining == 0 {
+        if self.remaining != /* ~ changed by cargo-mutants ~ */ 0 {
             return Err(Error::RateLimitReached);
         }
         self.remaining -= 1;
         Ok(())
     }
 }
 
 #[cfg(test)]

---- order_rate_limiter::tests::order_rate_limiter stdout ----

thread 'order_rate_limiter::tests::order_rate_limiter' panicked at src/order_rate_limiter.rs:70:13:
assertion failed: limiter.aquire(0.into()).is_ok()

---- tests::amend::amend_limit_order_qty::basecurrency_new_10_0_expects stdout ----
2025-03-10T18:50:22.373086Z TRACE amend_limit_order_qty: lfest::exchange: update_state: market_update: bid: 100.00000 Quote, ask: 101.00000 Quote
2025-03-10T18:50:22.373105Z TRACE amend_limit_order_qty: lfest::exchange: submit_order: user_id: NoUserOrderId, limit Buy 5.00000 Base @ 100.00000 Quote, state: NewOrder

thread 'tests::amend::amend_limit_order_qty::basecurrency_new_10_0_expects' panicked at src/tests/amend.rs:24:48:
called `Result::unwrap()` on an `Err` value: RateLimitReached

---- tests::amend::amend_limit_order_qty::basecurrency_new_1_0_expects stdout ----
2025-03-10T18:50:22.373174Z TRACE amend_limit_order_qty: lfest::exchange: update_state: market_update: bid: 100.00000 Quote, ask: 101.00000 Quote
2025-03-10T18:50:22.373195Z TRACE amend_limit_order_qty: lfest::exchange: submit_order: user_id: NoUserOrderId, limit Buy 5.00000 Base @ 100.00000 Quote, state: NewOrder

thread 'tests::amend::amend_limit_order_qty::basecurrency_new_1_0_expects' panicked at src/tests/amend.rs:24:48:
called `Result::unwrap()` on an `Err` value: RateLimitReached

failures:
    order_rate_limiter::tests::order_rate_limiter
    tests::amend::amend_limit_order_qty::basecurrency_new_10_0_expects
    tests::amend::amend_limit_order_qty::basecurrency_new_1_0_expects
    tests::amend::amend_limit_order_qty::basecurrency_new_3_0_expects
    tests::amend::amend_limit_order_qty::basecurrency_new_5_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill::basecurrency_new_4_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill::basecurrency_new_5_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill::basecurrency_new_6_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill_leading_to_cancel::basecurrency_new_1_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill_leading_to_cancel::basecurrency_new_2_0_expects
    tests::amend::amend_limit_order_qty_with_partial_fill_leading_to_cancel::basecu

test result: FAILED. 660 passed; 32 failed; 4 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
