*** src/position.rs:168:56: replace - with + in Position<I, D, BaseOrQuote>::change_position

*** mutation diff:
--- src/position.rs
+++ replace - with + in Position<I, D, BaseOrQuote>::change_position
@@ -160,17 +160,17 @@
                         debug_assert_eq!(
                             transaction_accounting
                                 .margin_balance_of(USER_POSITION_MARGIN_ACCOUNT)
                                 .expect("Is valid account"),
                             BaseOrQuote::PairedCurrency::zero()
                         );
                     }
                     Ordering::Greater => {
-                        let new_short_qty = filled_qty - inner.quantity();
+                        let new_short_qty = filled_qty + /* ~ changed by cargo-mutants ~ */ inner.quantity();
                         inner.decrease_contracts(
                             inner.quantity(),
                             fill_price,
                             transaction_accounting,
                             init_margin_req,
                             1,
                             fees,
                         );

---- tests::submit_market_sell_order::submit_market_sell_order_turnaround_long stdout ----
2025-03-10T18:50:46.379365Z TRACE lfest::exchange: update_state: market_update: bid: 99.00000 Quote, ask: 100.00000 Quote
2025-03-10T18:50:46.379926Z TRACE lfest::position_inner: new position: qty 9.00000 Base @ 100.00000 Quote

thread 'tests::submit_market_sell_order::submit_market_sell_order_turnaround_long' panicked at src/tests/submit_market_sell_order.rs:223:5:
assertion `left == right` failed

failures:
    tests::submit_market_sell_order::submit_market_sell_order_turnaround_long

test result: FAILED. 691 passed; 1 failed; 4 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
