*** src/position_inner.rs:145:23: replace += with -= in PositionInner<I, D, BaseOrQuote>::increase_contracts

*** mutation diff:
--- src/position_inner.rs
+++ replace += with -= in PositionInner<I, D, BaseOrQuote>::increase_contracts
@@ -137,17 +137,17 @@
         let value = BaseOrQuote::PairedCurrency::convert_from(qty, entry_price);
         let new_entry_price = QuoteCurrency::new_weighted_price(
             self.entry_price,
             *self.quantity.as_ref(),
             entry_price,
             *qty.as_ref(),
         );
 
-        self.quantity += qty;
+        self.quantity -= /* ~ changed by cargo-mutants ~ */ qty;
         self.entry_price = new_entry_price;
         self.outstanding_fees += fees;
 
         let margin = value * init_margin_req;
         let transaction =
             Transaction::new(USER_POSITION_MARGIN_ACCOUNT, USER_WALLET_ACCOUNT, margin);
         accounting
             .create_margin_transfer(transaction)

---- position_inner::tests::position_inner_increase_contracts::_1_expects stdout ----
2025-03-10T18:50:58.381142Z TRACE lfest::position_inner: new position: qty 0.50000 Base @ 100.00000 Quote
2025-03-10T18:50:58.381170Z TRACE lfest::accounting::in_memory_accounting: create_margin_transfer: debit_account_id: USER_POSITION_MARGIN_ACCOUNT, credit_account_id: USER_WALLET_ACCOUNT, amount: 50.00000 Quote
2025-03-10T18:50:58.381182Z DEBUG lfest::position_inner: increase_contracts: qty: 0.50000 Base @ 150.00000 Quote; self: PositionInner( quantity: 0.50000 Base, outstanding_fees: 0.01000 Quote)
2025-03-10T18:50:58.381196Z TRACE lfest::accounting::in_memory_accounting: create_margin_transfer: debit_account_id: USER_POSITION_MARGIN_ACCOUNT, credit_account_id: USER_WALLET_ACCOUNT, amount: 75.00000 Quote

thread 'position_inner::tests::position_inner_increase_contracts::_1_expects' panicked at src/p

---- position_inner::tests::position_inner_increase_contracts::_2_expects stdout ----
2025-03-10T18:50:58.381162Z TRACE lfest::position_inner: new position: qty 0.50000 Base @ 100.00000 Quote
2025-03-10T18:50:58.381193Z TRACE lfest::accounting::in_memory_accounting: create_margin_transfer: debit_account_id: USER_POSITION_MARGIN_ACCOUNT, credit_account_id: USER_WALLET_ACCOUNT, amount: 25.00000 Quote
2025-03-10T18:50:58.381200Z DEBUG lfest::position_inner: increase_contracts: qty: 0.50000 Base @ 150.00000 Quote; self: PositionInner( quantity: 0.50000 Base, outstanding_fees: 0.01000 Quote)
2025-03-10T18:50:58.381215Z TRACE lfest::accounting::in_memory_accounting: create_margin_transfer: debit_account_id: USER_POSITION_MARGIN_ACCOUNT, credit_account_id: USER_WALLET_ACCOUNT, amount: 37.50000 Quote

thread 'position_inner::tests::position_inner_increase_contracts::_2_expects' panicked at src/p

---- position_inner::tests::position_inner_increase_contracts::_5_expects stdout ----
2025-03-10T18:50:58.381204Z TRACE lfest::position_inner: new position: qty 0.50000 Base @ 100.00000 Quote
2025-03-10T18:50:58.381233Z TRACE lfest::accounting::in_memory_accounting: create_margin_transfer: debit_account_id: USER_POSITION_MARGIN_ACCOUNT, credit_account_id: USER_WALLET_ACCOUNT, amount: 10.00000 Quote
2025-03-10T18:50:58.381242Z DEBUG lfest::position_inner: increase_contracts: qty: 0.50000 Base @ 150.00000 Quote; self: PositionInner( quantity: 0.50000 Base, outstanding_fees: 0.01000 Quote)
2025-03-10T18:50:58.381257Z TRACE lfest::accounting::in_memory_accounting: create_margin_transfer: debit_account_id: USER_POSITION_MARGIN_ACCOUNT, credit_account_id: USER_WALLET_ACCOUNT, amount: 15.00000 Quote

thread 'position_inner::tests::position_inner_increase_contracts::_5_expects' panicked at src/p

failures:
    position_inner::tests::position_inner_increase_contracts::_1_expects
    position_inner::tests::position_inner_increase_contracts::_2_expects
    position_inner::tests::position_inner_increase_contracts::_5_expects
    tests::submit_market_buy_order::submit_market_buy_order_with_long_position
    tests::submit_market_sell_order::submit_market_sell_order_with_short_position

test result: FAILED. 687 passed; 5 failed; 4 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
