*** src/risk_engine/isolated_margin.rs:164:41: replace > with < in IsolatedMarginRiskEngine<I, D, BaseOrQuote>::check_market_buy_order

*** mutation diff:
--- src/risk_engine/isolated_margin.rs
+++ replace > with < in IsolatedMarginRiskEngine<I, D, BaseOrQuote>::check_market_buy_order
@@ -156,17 +156,17 @@
 
                 let new_long_size = Self::quantity_minus_position(order.quantity(), pos_inner);
                 let new_notional_value =
                     BaseOrQuote::PairedCurrency::convert_from(new_long_size, fill_price);
                 let new_margin_req = new_notional_value * self.contract_spec.init_margin_req();
 
                 let fee = new_notional_value * *self.contract_spec.fee_taker().as_ref();
 
-                if new_margin_req + fee > available_wallet_balance + released_from_old_pos {
+                if new_margin_req + fee < /* ~ changed by cargo-mutants ~ */ available_wallet_balance + released_from_old_pos {
                     return Err(RiskError::NotEnoughAvailableBalance);
                 }
             }
         }
 
         Ok(())
     }

---- tests::submit_market_buy_order::submit_market_buy_order_turnaround_short stdout ----
2025-03-10T18:50:30.256205Z TRACE submit_market_buy_order_turnaround_short: lfest::exchange: update_state: market_update: bid: 99.00000 Quote, ask: 100.00000 Quote
2025-03-10T18:50:30.258952Z TRACE submit_market_buy_order_turnaround_short: lfest::position_inner: new position: qty 9.00000 Base @ 99.00000 Quote

thread 'tests::submit_market_buy_order::submit_market_buy_order_turnaround_short' panicked at src/tests/submit_market_buy_order.rs:255:41:
called `Result::unwrap()` on an `Err` value: RiskError(NotEnoughAvailableBalance)

failures:
    tests::submit_market_buy_order::submit_market_buy_order_turnaround_short

test result: FAILED. 691 passed; 1 failed; 4 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
