*** src/risk_engine/isolated_margin.rs:193:37: replace > with == in IsolatedMarginRiskEngine<I, D, BaseOrQuote>::check_market_sell_order

*** mutation diff:
--- src/risk_engine/isolated_margin.rs
+++ replace > with == in IsolatedMarginRiskEngine<I, D, BaseOrQuote>::check_market_sell_order
@@ -185,17 +185,17 @@
 
         match position {
             Position::Neutral | Position::Short(_) => {
                 let notional_value =
                     BaseOrQuote::PairedCurrency::convert_from(order.quantity(), fill_price);
                 let margin_req = notional_value * self.contract_spec.init_margin_req();
                 let fee = notional_value * *self.contract_spec.fee_taker().as_ref();
 
-                if margin_req + fee > available_wallet_balance {
+                if margin_req + fee == /* ~ changed by cargo-mutants ~ */ available_wallet_balance {
                     return Err(RiskError::NotEnoughAvailableBalance);
                 }
             }
             Position::Long(pos_inner) => {
                 // Else its a long position which needs to be reduced
                 if order.quantity() <= pos_inner.quantity() {
                     // The order strictly reduces the position, so no additional margin is required.
                     return Ok(());

---- tests::submit_market_sell_order::submit_market_sell_order_reject stdout ----
2025-03-10T18:51:00.733197Z TRACE lfest::exchange: update_state: market_update: bid: 100.00000 Quote, ask: 101.00000 Quote

thread 'tests::submit_market_sell_order::submit_market_sell_order_reject' panicked at src/tests/submit_market_sell_order.rs:20:5:
assertion `left == right` failed
 right: Err(RiskError(NotEnoughAvailableBalance))

failures:
    tests::submit_market_sell_order::submit_market_sell_order_reject

test result: FAILED. 691 passed; 1 failed; 4 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
