*** src/risk_engine/isolated_margin.rs:215:35: replace + with * in IsolatedMarginRiskEngine<I, D, BaseOrQuote>::check_market_sell_order

*** mutation diff:
--- src/risk_engine/isolated_margin.rs
+++ replace + with * in IsolatedMarginRiskEngine<I, D, BaseOrQuote>::check_market_sell_order
@@ -207,17 +207,17 @@
                 assert2::debug_assert!(new_short_size > BaseOrQuote::zero());
                 let new_notional_value =
                     BaseOrQuote::PairedCurrency::convert_from(new_short_size, fill_price);
                 let new_margin_req = new_notional_value * self.contract_spec.init_margin_req();
                 assert2::debug_assert!(new_margin_req > BaseOrQuote::PairedCurrency::zero());
 
                 let fee = new_notional_value * *self.contract_spec.fee_taker().as_ref();
 
-                if new_margin_req + fee > available_wallet_balance + released_from_old_pos {
+                if new_margin_req * /* ~ changed by cargo-mutants ~ */ fee > available_wallet_balance + released_from_old_pos {
                     return Err(RiskError::NotEnoughAvailableBalance);
                 }
             }
         }
         Ok(())
     }
 
     #[inline(always)]

*** result: Success
