*** src/risk_engine/isolated_margin.rs:228:9: replace IsolatedMarginRiskEngine<I, D, BaseOrQuote>::quantity_minus_position -> BaseOrQuote with Default::default()

*** mutation diff:
--- src/risk_engine/isolated_margin.rs
+++ replace IsolatedMarginRiskEngine<I, D, BaseOrQuote>::quantity_minus_position -> BaseOrQuote with Default::default()
@@ -220,17 +220,17 @@
         Ok(())
     }
 
     #[inline(always)]
     fn quantity_minus_position(
         quantity: BaseOrQuote,
         position_inner: &PositionInner<I, D, BaseOrQuote>,
     ) -> BaseOrQuote {
-        quantity - position_inner.quantity()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use const_decimal::Decimal;
     use num_traits::One;


