*** src/types/mod.rs:72:9: replace UserBalances<I, D, BaseOrQuote>::sum -> BaseOrQuote with Default::default()

*** mutation diff:
--- src/types/mod.rs
+++ replace UserBalances<I, D, BaseOrQuote>::sum -> BaseOrQuote with Default::default()
@@ -64,17 +64,17 @@
 
 impl<I, const D: u8, BaseOrQuote> UserBalances<I, D, BaseOrQuote>
 where
     I: Mon<D>,
     BaseOrQuote: MarginCurrency<I, D>,
 {
     /// Sum of all balances.
     pub fn sum(&self) -> BaseOrQuote {
-        self.available_wallet_balance + self.position_margin + self.order_margin
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A custom user order id must satisfy this trait bound.
 pub trait UserOrderId:
     Clone + Copy + Eq + PartialEq + std::fmt::Debug + std::fmt::Display + Default
 {
 }

*** result: Success
