*** src/utils.rs:61:5: replace decimal_from_f64 -> Result<Decimal<I, D>> with Ok(Default::default())

*** mutation diff:
--- src/utils.rs
+++ replace decimal_from_f64 -> Result<Decimal<I, D>> with Ok(Default::default())
@@ -53,22 +53,17 @@
         .expect("is valid");
     assert!(wallet_balance >= BaseOrQuote::zero());
 }
 
 /// Create a `Decimal` from an `f64` value.
 // TODO: maybe upstream this impl to `const_decimal`
 #[inline(always)]
 pub fn decimal_from_f64<I: Mon<D>, const D: u8>(val: f64) -> Result<Decimal<I, D>> {
-    let scaling_factor = 10_f64.powi(D as i32);
-    let scaled: f64 = (val * scaling_factor).round();
-    Ok(
-        Decimal::try_from_scaled(I::from(scaled as i64).ok_or(Error::IntegerConversion)?, D)
-            .ok_or(Error::UnableToCreateDecimal)?,
-    )
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 pub(crate) mod tests {
     use const_decimal::Decimal;
 
     use crate::utils::decimal_from_f64;

---- utils::tests::test_decimal_from_f64 stdout ----

thread 'utils::tests::test_decimal_from_f64' panicked at src/utils.rs:82:9:
assertion `left == right` failed
  left: Decimal(0)
 right: Decimal(300000)

failures:
    utils::tests::test_decimal_from_f64

test result: FAILED. 691 passed; 1 failed; 4 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
